Ran Plan for dir: `infrastructure/terraform/github` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # github_repository.insight will be updated in-place
~ resource "github_repository" "insight" {
        allow_merge_commit     = false
        allow_rebase_merge     = false
        allow_squash_merge     = true
        archived               = false
        default_branch         = "master"
        delete_branch_on_merge = true
        description            = "Find insights into your frontend applications."
        etag                   = "W/\"2c56e82c74bea706238c703a9b91ced1\""
        full_name              = "insights-io/Insight"
        git_clone_url          = "git://github.com/insights-io/Insight.git"
        has_downloads          = false
        has_issues             = true
        has_projects           = true
        has_wiki               = true
        html_url               = "https://github.com/insights-io/Insight"
        http_clone_url         = "https://github.com/insights-io/Insight.git"
        id                     = "Insight"
        is_template            = false
        name                   = "Insight"
        node_id                = "MDEwOlJlcG9zaXRvcnkyNzA5NTAzMDU="
        private                = false
        ssh_clone_url          = "git@github.com:insights-io/Insight.git"
        svn_url                = "https://github.com/insights-io/Insight"
      ~ topics                 = [
          - "elasticsearch",
          - "github-actions",
          - "gradle",
          - "jaegertracing",
          - "java",
          - "javascript",
          - "kafka",
          - "kubernetes",
          - "postgresql",
          - "quarkus",
          - "react",
          - "storybook",
          - "typescript",
          - "vertx",
        ]
    }

  # github_repository.ops will be created
+ resource "github_repository" "ops" {
      + allow_merge_commit     = false
      + allow_rebase_merge     = false
      + allow_squash_merge     = false
      + archived               = false
      + default_branch         = "master"
      + delete_branch_on_merge = false
      + description            = "Insight operations"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "ops"
      + node_id                = (known after apply)
      + private                = false
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
    }

  # module.branch_protection.github_branch_protection.branch_protection will be updated in-place
~ resource "github_branch_protection" "branch_protection" {
        branch                 = "master"
      ~ enforce_admins         = false -> true
        etag                   = "W/\"7b5570235231cf93a47f04b1d120f4a0\""
        id                     = "Insight:master"
        repository             = "Insight"
        require_signed_commits = false

        required_pull_request_reviews {
            dismiss_stale_reviews           = true
            dismissal_teams                 = []
            dismissal_users                 = []
            include_admins                  = false
            require_code_owner_reviews      = false
            required_approving_review_count = 1
        }

        required_status_checks {
            contexts       = []
            include_admins = false
            strict         = true
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infrastructure/terraform/github`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.dev.snuderls.eu/lock?id=insights-io%252FInsight%252Finfrastructure%252Fterraform%252Fgithub%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infrastructure/terraform/github`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
